DataProcessors/омг_ПанельАдминистрированияИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_ПанельАдминистрированияИнтеграций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/омг_КлючиОбновленийСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_КлючиОбновленийСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеАнализовЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеЦенЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеАрхивированных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеБиоматериаловЛИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/омг_ПанельАдминистрированияИнтеграций/Forms/ОбменДаннымиСЛИС/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСправочникиНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАнализовЛИС);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочники(Команда)
	ОбновитьСправочникиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникиИЦеныНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеЦенЛИС);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникиИЦены(Команда)
	ОбновитьСправочникиИЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникиБиоматериаловИКонтейнеровНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеБиоматериаловЛИС);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникиБиоматериаловИКонтейнеров(Команда)
	ОбновитьСправочникиБиоматериаловИКонтейнеровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьАрхивированностьНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАрхивированных);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАрхивированность(Команда)
	ОбновитьАрхивированностьНаСервере();
КонецПроцедуры
